src/DataProcessors/ЗаменитьВсеСсылкиНаПредопределенныеЭлементыСправорчникаТараВДокументах/ЗаменитьВсеСсылкиНаПредопределенныеЭлементыСправорчникаТараВДокументах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗаменитьВсеСсылкиНаПредопределенныеЭлементыСправорчникаТараВДокументах</name>
</mdclass:DataProcessor>

src/Documents/ВыпускПродукции/ВыпускПродукции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВыпускПродукции</name>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Адресат</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьPID</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РучныеИзмененияТребуемыхЗначений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Реквизит</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокКабелей</name>
    <attributes>
      <name>PID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Артикул</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесБрутто</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесНетто</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидСертификата</name>
      <type>
        <types>EnumRef.ВидыСертификатов</types>
      </type>
    </attributes>
    <attributes>
      <name>ВыгружатьВыделеннуюСтроку</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Гост</name>
      <type>
        <types>CatalogRef.Госты</types>
      </type>
    </attributes>
    <attributes>
      <name>ДругоеНапряжение</name>
      <type>
        <types>CatalogRef.Напряжения</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КодРосстандарта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоСтрокой</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Марка</name>
      <type>
        <types>CatalogRef.МаркиКабелей</types>
      </type>
    </attributes>
    <attributes>
      <name>МаркаНапряжение</name>
      <type>
        <types>CatalogRef.Напряжения</types>
      </type>
    </attributes>
    <attributes>
      <name>НеДолжноБытьПробояПри</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерБарабана</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерЗаявки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерИспытания</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Обшив</name>
      <type>
        <types>CatalogRef.Обшив</types>
      </type>
    </attributes>
    <attributes>
      <name>Отрезок</name>
      <type>
        <types>CatalogRef.Отрезки</types>
      </type>
    </attributes>
    <attributes>
      <name>ПризнакРучныеИзмененияТребуемыхЗначений</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Размер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РассчитываемоеКоличествоБухт</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>РезультатИспытанияЖилаЗаземления</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РезультатИспытанияЖилаКоричневая</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РезультатИспытанияЖилаОсновная</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РезультатИспытанияЖилаСиняя</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РезультатИспытанияЖилаЧерная</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РезультатИспытанияИзоляцииЖилаЗаземления</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РезультатИспытанияИзоляцииЖилаКоричневая</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РезультатИспытанияИзоляцииЖилаОсновная</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РезультатИспытанияИзоляцииЖилаСиняя</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РезультатИспытанияИзоляцииЖилаЧерная</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РучноеРедактированиеКоличествоСтрокой</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>РучноеРедактированиеРазмерКабеляИОтрезок</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаКоличество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Тара</name>
      <type>
        <types>CatalogRef.Тара</types>
      </type>
    </attributes>
    <attributes>
      <name>ТребуемоеЗначениеЖилаЗаземления</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТребуемоеЗначениеЖилаКоричневая</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТребуемоеЗначениеЖилаОсновная</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТребуемоеЗначениеЖилаСиняя</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТребуемоеЗначениеЖилаЧерная</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТребуемоеЗначениеИзоляцииЖилаЗаземления</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТребуемоеЗначениеИзоляцииЖилаКоричневая</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТребуемоеЗначениеИзоляцииЖилаОсновная</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТребуемоеЗначениеИзоляцииЖилаСиняя</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТребуемоеЗначениеИзоляцииЖилаЧерная</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦветКабеля</name>
      <type>
        <types>CatalogRef.ЦветаКабеля</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШтампОТК</name>
      <type>
        <types>CatalogRef.ШтампыОТК</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/DataProcessors/ЗаменитьВсеСсылкиНаПредопределенныеЭлементыСправорчникаТараВДокументах/Forms/Форма/Module.bsl
&НаСервере
Функция  ВыполнитьЗаменуНаСервере()
		Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВыпускПродукции.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ВыпускПродукции КАК ВыпускПродукции";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ОбъектДокумент = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		Для Каждого Стр из ОбъектДокумент.СписокКабелей Цикл 
			Если Стр.Тара.Наименование = "Бухта" Тогда 
				Стр.Тара = Справочники.Тара.Бухта;
			КонецЕсли;
		КонецЦикла;
		ОбъектДокумент.Записать();
	КонецЦикла;
	
	Возврат ОбъектДокумент.Ссылка;
КонецФункции

&НаКлиенте
Процедура ВыполнитьЗамену(Команда) 
	
	ПоказатьПредупреждение(Новый ОписаниеОповещения("ОбработкаКомандыЗавершение", ЭтотОбъект), "Будет произведена замена ссылок на предопределенный элемент   справочника Тара, Бухта
					|Выполнение можно прервать, нажав сочетание клавиш Ctrl + Break",
					,
					"Добавление товаров");

	
КонецПроцедуры    

&НаКлиенте
Процедура ОбработкаКомандыЗавершение(ДополнительныеПараметры) Экспорт
	
	Для Счетчик = 0 по 9 Цикл
		
		ПоследняяДобавленнаяСсылка = ВыполнитьЗаменуНаСервере();
		Состояние("замена  ссылок в документах",
		10 + Счетчик * 10,
		"Выполнятеся  замена ссылок в документах",
		БиблиотекаКартинок.Заменить);
		
		ОбработкаПрерыванияПользователя();		  
		
	КонецЦикла;
	
	
	// Обновить список товаров на начальной странице
	ОповеститьОбИзменении(ПоследняяДобавленнаяСсылка);
	
	ПоказатьОповещениеПользователя("Данные заполнены",
	ПолучитьНавигационнуюСсылку(ПоследняяДобавленнаяСсылка),
	"Открыть последний документ  с замещаемой ссылкой",
	БиблиотекаКартинок.Документ, СтатусОповещенияПользователя.Важное);

КонецПроцедуры
